---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DirectShapeLibrary
source: html/a37160c8-6f87-cdd4-e772-5ef618363edc.htm
---
# DirectShapeLibrary Members

Add a definition to be reused by instances. A definition is a single geometry object.